## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITHUB_PAT" -> "GITLAB_TOKEN"
                              ~ property = "data.GITHUB_PAT" -> "data.GITLAB_TOKEN"
                            }
                          ~ secretKey = "GITHUB_PAT" -> "GITLAB_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITLAB_TOKEN" -> "HARBOR_KEY"
                              ~ property = "data.GITLAB_TOKEN" -> "data.HARBOR_KEY"
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "HARBOR_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                              ~ property = "data.HARBOR_KEY" -> "data.ISTIO_PRIMARY_CA"
                            }
                          ~ secretKey = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                              ~ property = "data.ISTIO_PRIMARY_CA" -> "data.KUBECONFIG"
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "KUBECONFIG" -> "MINIO"
                              ~ property = "data.KUBECONFIG" -> "data.rootPassword"
                            }
                          ~ secretKey = "KUBECONFIG" -> "rootPassword"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.rootPassword" -> "data.rootUser"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "rootPassword" -> "rootUser"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "MINIO" -> "POSTGRES"
                              ~ property = "data.rootUser" -> "data.DATA"
                            }
                          ~ secretKey = "rootUser" -> "DATA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.DATA" -> "data.POSTGRES_DATABASE"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "DATA" -> "POSTGRES_DATABASE"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_DATABASE" -> "data.POSTGRES_HOST"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "POSTGRES_HOST"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_HOST" -> "data.POSTGRES_PASSWORD"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_PORT"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_PORT"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PORT" -> "data.POSTGRES_USER"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_USER"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "POSTGRES" -> "REDIS"
                              ~ property = "data.POSTGRES_USER" -> "data.REDIS_PASSWORD"
                            }
                          ~ secretKey = "POSTGRES_USER" -> "REDIS_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "REDIS" -> "SOPS"
                              ~ property = "data.REDIS_PASSWORD" -> "data.SOPS"
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "SOPS"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SOPS" -> "SSH_PRIVATE_KEY"
                              ~ property = "data.SOPS" -> "data.SSH_PRIVATE_KEY"
                            }
                          ~ secretKey = "SOPS" -> "SSH_PRIVATE_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property = "data.SSH_PRIVATE_KEY" -> "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          ~ secretKey = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                              ~ property = "data.TF_VAR_PROXMOX_PASSWORD" -> "data.TF_VAR_VAULT_TOKEN"
                            }
                          ~ secretKey = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                              ~ property = "data.TF_VAR_VAULT_TOKEN" -> "data.VAULT_TOKEN"
                            }
                          ~ secretKey = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "VAULT_TOKEN" -> "github_token"
                              ~ property = "data.VAULT_TOKEN" -> "data.github_token"
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "github_token"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                metadataPolicy     = "None"
                                property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                                version            = null
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "GITHUB_PAT" -> "GITLAB_TOKEN"
                              ~ property           = "data.GITHUB_PAT" -> "data.GITLAB_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "GITHUB_PAT" -> "GITLAB_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "GITLAB_TOKEN" -> "HARBOR_KEY"
                              ~ property           = "data.GITLAB_TOKEN" -> "data.HARBOR_KEY"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "HARBOR_KEY"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                              ~ property           = "data.HARBOR_KEY" -> "data.ISTIO_PRIMARY_CA"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                              ~ property           = "data.ISTIO_PRIMARY_CA" -> "data.KUBECONFIG"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "KUBECONFIG" -> "MINIO"
                              ~ property           = "data.KUBECONFIG" -> "data.rootPassword"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "KUBECONFIG" -> "rootPassword"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.rootPassword" -> "data.rootUser"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootPassword" -> "rootUser"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "MINIO" -> "POSTGRES"
                              ~ property           = "data.rootUser" -> "data.DATA"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootUser" -> "DATA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.DATA" -> "data.POSTGRES_DATABASE"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "DATA" -> "POSTGRES_DATABASE"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_DATABASE" -> "data.POSTGRES_HOST"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "POSTGRES_HOST"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_HOST" -> "data.POSTGRES_PASSWORD"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_PORT"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_PORT"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PORT" -> "data.POSTGRES_USER"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_USER"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "POSTGRES" -> "REDIS"
                              ~ property           = "data.POSTGRES_USER" -> "data.REDIS_PASSWORD"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_USER" -> "REDIS_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "REDIS" -> "SOPS"
                              ~ property           = "data.REDIS_PASSWORD" -> "data.SOPS"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "SOPS"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "SOPS" -> "SSH_PRIVATE_KEY"
                              ~ property           = "data.SOPS" -> "data.SSH_PRIVATE_KEY"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "SOPS" -> "SSH_PRIVATE_KEY"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property           = "data.SSH_PRIVATE_KEY" -> "data.TF_VAR_PROXMOX_PASSWORD"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                              ~ property           = "data.TF_VAR_PROXMOX_PASSWORD" -> "data.TF_VAR_VAULT_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                              ~ property           = "data.TF_VAR_VAULT_TOKEN" -> "data.VAULT_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "VAULT_TOKEN" -> "github_token"
                              ~ property           = "data.VAULT_TOKEN" -> "data.github_token"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "github_token"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.externaldns[0].kubernetes_cluster_role_binding.externaldns will be updated in-place
  ~ resource "kubernetes_cluster_role_binding" "externaldns" {
        id = "external-dns-viewer"

      ~ subject {
            name      = "external-dns"
          ~ namespace = "externaldns" -> "external-dns"
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.externaldns[0].kubernetes_deployment.externaldns is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "externaldns" {
      ~ id               = "externaldns/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ namespace        = "externaldns" -> "external-dns"
          ~ resource_version = "3956861" -> (known after apply)
          ~ uid              = "c82d9fa7-b49d-413d-a2ed-b08c3e54a710" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                    # (13 unchanged attributes hidden)

                  ~ container {
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "external-dns"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (7 unchanged attributes hidden)

                      + env {
                          + name = "EXTERNAL_DNS_PIHOLE_PASSWORD"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "PIHOLE_PASSWORD"
                                  + name = "pihole-password"
                                }
                            }
                        }

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (1 unchanged block hidden)
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)

                  ~ security_context {
                      - supplemental_groups    = [] -> null
                        # (5 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.externaldns[0].kubernetes_service_account.externaldns must be replaced
-/+ resource "kubernetes_service_account" "externaldns" {
      + default_secret_name             = (known after apply)
      ~ id                              = "externaldns/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ namespace        = "externaldns" -> "external-dns" # forces replacement
          ~ resource_version = "3956061" -> (known after apply)
          ~ uid              = "29444722-50ea-47cc-a04f-ef47dd150f39" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.externaldns[0].module.namespace.kubernetes_namespace.this[0] must be replaced
-/+ resource "kubernetes_namespace" "this" {
      ~ id                               = "externaldns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          ~ labels           = {
              ~ "kubernetes.io/metadata.name" = "externaldns" -> "external-dns"
                # (1 unchanged element hidden)
            }
          ~ name             = "externaldns" -> "external-dns" # forces replacement
          ~ resource_version = "3956057" -> (known after apply)
          ~ uid              = "4b51e928-0a2b-4ea1-ae92-1425f36d0db6" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITHUB_PAT" -> "GITLAB_TOKEN"
                              ~ property = "data.GITHUB_PAT" -> "data.GITLAB_TOKEN"
                            }
                          ~ secretKey = "GITHUB_PAT" -> "GITLAB_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITLAB_TOKEN" -> "HARBOR_KEY"
                              ~ property = "data.GITLAB_TOKEN" -> "data.HARBOR_KEY"
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "HARBOR_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                              ~ property = "data.HARBOR_KEY" -> "data.ISTIO_PRIMARY_CA"
                            }
                          ~ secretKey = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                              ~ property = "data.ISTIO_PRIMARY_CA" -> "data.KUBECONFIG"
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "KUBECONFIG" -> "MINIO"
                              ~ property = "data.KUBECONFIG" -> "data.rootPassword"
                            }
                          ~ secretKey = "KUBECONFIG" -> "rootPassword"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.rootPassword" -> "data.rootUser"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "rootPassword" -> "rootUser"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "MINIO" -> "POSTGRES"
                              ~ property = "data.rootUser" -> "data.DATA"
                            }
                          ~ secretKey = "rootUser" -> "DATA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.DATA" -> "data.POSTGRES_DATABASE"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "DATA" -> "POSTGRES_DATABASE"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_DATABASE" -> "data.POSTGRES_HOST"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "POSTGRES_HOST"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_HOST" -> "data.POSTGRES_PASSWORD"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_PORT"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_PORT"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PORT" -> "data.POSTGRES_USER"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_USER"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "POSTGRES" -> "REDIS"
                              ~ property = "data.POSTGRES_USER" -> "data.REDIS_PASSWORD"
                            }
                          ~ secretKey = "POSTGRES_USER" -> "REDIS_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "REDIS" -> "SOPS"
                              ~ property = "data.REDIS_PASSWORD" -> "data.SOPS"
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "SOPS"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SOPS" -> "SSH_PRIVATE_KEY"
                              ~ property = "data.SOPS" -> "data.SSH_PRIVATE_KEY"
                            }
                          ~ secretKey = "SOPS" -> "SSH_PRIVATE_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property = "data.SSH_PRIVATE_KEY" -> "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          ~ secretKey = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                              ~ property = "data.TF_VAR_PROXMOX_PASSWORD" -> "data.TF_VAR_VAULT_TOKEN"
                            }
                          ~ secretKey = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                              ~ property = "data.TF_VAR_VAULT_TOKEN" -> "data.VAULT_TOKEN"
                            }
                          ~ secretKey = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "VAULT_TOKEN" -> "github_token"
                              ~ property = "data.VAULT_TOKEN" -> "data.github_token"
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "github_token"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                metadataPolicy     = "None"
                                property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                                version            = null
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "GITHUB_PAT" -> "GITLAB_TOKEN"
                              ~ property           = "data.GITHUB_PAT" -> "data.GITLAB_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "GITHUB_PAT" -> "GITLAB_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "GITLAB_TOKEN" -> "HARBOR_KEY"
                              ~ property           = "data.GITLAB_TOKEN" -> "data.HARBOR_KEY"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "HARBOR_KEY"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                              ~ property           = "data.HARBOR_KEY" -> "data.ISTIO_PRIMARY_CA"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                              ~ property           = "data.ISTIO_PRIMARY_CA" -> "data.KUBECONFIG"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "KUBECONFIG" -> "MINIO"
                              ~ property           = "data.KUBECONFIG" -> "data.rootPassword"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "KUBECONFIG" -> "rootPassword"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.rootPassword" -> "data.rootUser"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootPassword" -> "rootUser"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "MINIO" -> "POSTGRES"
                              ~ property           = "data.rootUser" -> "data.DATA"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootUser" -> "DATA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.DATA" -> "data.POSTGRES_DATABASE"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "DATA" -> "POSTGRES_DATABASE"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_DATABASE" -> "data.POSTGRES_HOST"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "POSTGRES_HOST"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_HOST" -> "data.POSTGRES_PASSWORD"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_PORT"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_PORT"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PORT" -> "data.POSTGRES_USER"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_USER"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "POSTGRES" -> "REDIS"
                              ~ property           = "data.POSTGRES_USER" -> "data.REDIS_PASSWORD"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_USER" -> "REDIS_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "REDIS" -> "SOPS"
                              ~ property           = "data.REDIS_PASSWORD" -> "data.SOPS"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "SOPS"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "SOPS" -> "SSH_PRIVATE_KEY"
                              ~ property           = "data.SOPS" -> "data.SSH_PRIVATE_KEY"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "SOPS" -> "SSH_PRIVATE_KEY"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property           = "data.SSH_PRIVATE_KEY" -> "data.TF_VAR_PROXMOX_PASSWORD"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                              ~ property           = "data.TF_VAR_PROXMOX_PASSWORD" -> "data.TF_VAR_VAULT_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                              ~ property           = "data.TF_VAR_VAULT_TOKEN" -> "data.VAULT_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "VAULT_TOKEN" -> "github_token"
                              ~ property           = "data.VAULT_TOKEN" -> "data.github_token"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "github_token"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.externaldns[0].kubernetes_cluster_role_binding.externaldns will be updated in-place
  ~ resource "kubernetes_cluster_role_binding" "externaldns" {
        id = "external-dns-viewer"

      ~ subject {
            name      = "external-dns"
          ~ namespace = "externaldns" -> "external-dns"
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.externaldns[0].kubernetes_deployment.externaldns must be replaced
-/+ resource "kubernetes_deployment" "externaldns" {
      ~ id               = "externaldns/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ namespace        = "externaldns" -> "external-dns" # forces replacement
          ~ resource_version = "3180181" -> (known after apply)
          ~ uid              = "410315c9-8477-4d61-a30d-5d00ee1918fe" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                    # (13 unchanged attributes hidden)

                  ~ container {
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "external-dns"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (7 unchanged attributes hidden)

                      + env {
                          + name = "EXTERNAL_DNS_PIHOLE_PASSWORD"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "PIHOLE_PASSWORD"
                                  + name = "pihole-password"
                                }
                            }
                        }

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (1 unchanged block hidden)
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)

                  ~ security_context {
                      - supplemental_groups    = [] -> null
                        # (5 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.externaldns[0].kubernetes_service_account.externaldns must be replaced
-/+ resource "kubernetes_service_account" "externaldns" {
      + default_secret_name             = (known after apply)
      ~ id                              = "externaldns/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ namespace        = "externaldns" -> "external-dns" # forces replacement
          ~ resource_version = "3179627" -> (known after apply)
          ~ uid              = "375aca98-321f-43f9-b088-0815c6c9b7fa" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.externaldns[0].module.namespace.kubernetes_namespace.this[0] must be replaced
-/+ resource "kubernetes_namespace" "this" {
      ~ id                               = "externaldns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          ~ labels           = {
              ~ "kubernetes.io/metadata.name" = "externaldns" -> "external-dns"
                # (1 unchanged element hidden)
            }
          ~ name             = "externaldns" -> "external-dns" # forces replacement
          ~ resource_version = "3179625" -> (known after apply)
          ~ uid              = "acf3c9fa-3882-4921-9c9a-05aa85ef2dd3" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITHUB_PAT" -> "GITLAB_TOKEN"
                              ~ property = "data.GITHUB_PAT" -> "data.GITLAB_TOKEN"
                            }
                          ~ secretKey = "GITHUB_PAT" -> "GITLAB_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITLAB_TOKEN" -> "HARBOR_KEY"
                              ~ property = "data.GITLAB_TOKEN" -> "data.HARBOR_KEY"
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "HARBOR_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                              ~ property = "data.HARBOR_KEY" -> "data.ISTIO_PRIMARY_CA"
                            }
                          ~ secretKey = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                              ~ property = "data.ISTIO_PRIMARY_CA" -> "data.KUBECONFIG"
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "KUBECONFIG" -> "MINIO"
                              ~ property = "data.KUBECONFIG" -> "data.rootPassword"
                            }
                          ~ secretKey = "KUBECONFIG" -> "rootPassword"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.rootPassword" -> "data.rootUser"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "rootPassword" -> "rootUser"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "MINIO" -> "POSTGRES"
                              ~ property = "data.rootUser" -> "data.DATA"
                            }
                          ~ secretKey = "rootUser" -> "DATA"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.DATA" -> "data.POSTGRES_DATABASE"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "DATA" -> "POSTGRES_DATABASE"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_DATABASE" -> "data.POSTGRES_HOST"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "POSTGRES_HOST"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_HOST" -> "data.POSTGRES_PASSWORD"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_PORT"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_PORT"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property = "data.POSTGRES_PORT" -> "data.POSTGRES_USER"
                                # (1 unchanged attribute hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_USER"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "POSTGRES" -> "REDIS"
                              ~ property = "data.POSTGRES_USER" -> "data.REDIS_PASSWORD"
                            }
                          ~ secretKey = "POSTGRES_USER" -> "REDIS_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "REDIS" -> "SOPS"
                              ~ property = "data.REDIS_PASSWORD" -> "data.SOPS"
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "SOPS"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SOPS" -> "SSH_PRIVATE_KEY"
                              ~ property = "data.SOPS" -> "data.SSH_PRIVATE_KEY"
                            }
                          ~ secretKey = "SOPS" -> "SSH_PRIVATE_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property = "data.SSH_PRIVATE_KEY" -> "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          ~ secretKey = "SSH_PRIVATE_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                              ~ property = "data.TF_VAR_PROXMOX_PASSWORD" -> "data.TF_VAR_VAULT_TOKEN"
                            }
                          ~ secretKey = "TF_VAR_PROXMOX_PASSWORD" -> "TF_VAR_VAULT_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                              ~ property = "data.TF_VAR_VAULT_TOKEN" -> "data.VAULT_TOKEN"
                            }
                          ~ secretKey = "TF_VAR_VAULT_TOKEN" -> "VAULT_TOKEN"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "VAULT_TOKEN" -> "github_token"
                              ~ property = "data.VAULT_TOKEN" -> "data.github_token"
                            }
                          ~ secretKey = "VAULT_TOKEN" -> "github_token"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                metadataPolicy     = "None"
                                property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                                version            = null
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "GITHUB_PAT" -> "GITLAB_TOKEN"
                              ~ property           = "data.GITHUB_PAT" -> "data.GITLAB_TOKEN"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "GITHUB_PAT" -> "GITLAB_TOKEN"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "GITLAB_TOKEN" -> "HARBOR_KEY"
                              ~ property           = "data.GITLAB_TOKEN" -> "data.HARBOR_KEY"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "HARBOR_KEY"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                              ~ property           = "data.HARBOR_KEY" -> "data.ISTIO_PRIMARY_CA"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "HARBOR_KEY" -> "ISTIO_PRIMARY_CA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                              ~ property           = "data.ISTIO_PRIMARY_CA" -> "data.KUBECONFIG"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "ISTIO_PRIMARY_CA" -> "KUBECONFIG"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "KUBECONFIG" -> "MINIO"
                              ~ property           = "data.KUBECONFIG" -> "data.rootPassword"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "KUBECONFIG" -> "rootPassword"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.rootPassword" -> "data.rootUser"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootPassword" -> "rootUser"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "MINIO" -> "POSTGRES"
                              ~ property           = "data.rootUser" -> "data.DATA"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "rootUser" -> "DATA"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.DATA" -> "data.POSTGRES_DATABASE"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "DATA" -> "POSTGRES_DATABASE"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_DATABASE" -> "data.POSTGRES_HOST"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_DATABASE" -> "POSTGRES_HOST"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_HOST" -> "data.POSTGRES_PASSWORD"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_HOST" -> "POSTGRES_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PASSWORD" -> "data.POSTGRES_PORT"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "POSTGRES_PORT"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ property           = "data.POSTGRES_PORT" -> "data.POSTGRES_USER"
                                # (5 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PORT" -> "POSTGRES_USER"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "POSTGRES" -> "REDIS"
                              ~ property           = "data.POSTGRES_USER" -> "data.REDIS_PASSWORD"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_USER" -> "REDIS_PASSWORD"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "REDIS" -> "SOPS"
                              ~ property           = "data.REDIS_PASSWORD" -> "data.SOPS"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "REDIS_PASSWORD" -> "SOPS"
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "SOPS" -> "SSH_PRIVATE_KEY"
                              ~ property           = "data.SOPS" -> "data.SSH_PRIVATE_KEY"
                                # (4 unchanged attributes hidden)
  

... Output truncated due to size. See artifacts for full plan.
  ```
  
  Plan exit code: 0
  